ESBComponents/MessageValidator/src/test/resources/testdata/qd/Scenario18_QD_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://d4c0g0l1.aegis.net:9891/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:CrossGatewayQuery</Action>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:99d152e8-6587-44af-8e5c-09b93260ddd1</MessageID>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp wsu:Id="_1" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/">
				<wsu:Created>2012-02-28T15:05:16Z</wsu:Created>
				<wsu:Expires>2012-02-28T15:10:16Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion ID="5e82b88f-1b7e-466d-8258-72002c4af908" IssueInstant="2012-02-28T15:05:16.197Z" Version="2.0" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema">
				<saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer>
				<saml2:Subject>
					<saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 18 QDR-5.2a</saml2:NameID>
					<saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>0zcLhiAEnz5u0N6/3jLa3sEi32GjpwoXZJdFu0RqXE2Ta5Mi5lhDpp8jp4h5kIfvM6TW8bUlX/f5pPhUhSvFLvxXpCZLxjPq0uVGbHsdftrrpRJ06RfXFd100o0ZXWVt7AjnZtd4Qg66u86yyQUQI8yKEgepfsGkeXdcenmw4c6F9MKBVfHq75KT301K2HA9hOA9jCREeVam/mA4TjGtkm2XSskv3gjyybwH5XYjXhWgptZSushle2sINpDEdAeKUCfEfSyhTGmWdnw0cz0ophan9TsS/rkVlswBSc7Hm5fz1TkI5oeRQwafC6fTIySgiWGuWftiU8XNuHXQYU4XjQ==</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:AuthnStatement AuthnInstant="2012-02-28T15:05:15.712Z" SessionIndex="123456">
					<saml2:SubjectLocality/>
					<saml2:AuthnContext>
						<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
					</saml2:AuthnContext>
				</saml2:AuthnStatement>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">Lab IT Testcase</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.102</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.102</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.102</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue>
							<hl7:Role code="46255001" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Pharmacist" xsi:type="hl7:CE" xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue>
							<hl7:PurposeForUse code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xsi:type="hl7:CE" xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">RI2.102.00042^^^&amp;2.16.840.1.113883.0.102&amp;ISO</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
				<saml2:AuthzDecisionStatement Decision="Permit" Resource="https://d4c0g0l1.aegis.net:9891/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery">
					<saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
					<saml2:Evidence>
						<saml2:Assertion ID="e4dc9ebd-2a60-4b1f-8d0e-8c8fcb157f0d" IssueInstant="2012-02-28T15:05:15.712Z" Version="2.0">
							<saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer>
							<saml2:Conditions NotBefore="2012-02-28T15:05:15.712Z" NotOnOrAfter="2012-02-28T15:05:15.712Z"/>
							<saml2:AttributeStatement>
								<saml2:Attribute Name="AccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"/>
								<saml2:Attribute Name="InstanceAccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"/>
							</saml2:AttributeStatement>
						</saml2:Assertion>
					</saml2:Evidence>
				</saml2:AuthzDecisionStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
						<ds:Reference URI="#5e82b88f-1b7e-466d-8258-72002c4af908">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
							<ds:DigestValue>pSc8u94XeZoCUyhJIHrw4AbZNAw=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>MDlmTiqhZ00AFiiWlBsddln6ugPJieIj1CmB43BXgCbFR88VmCe+HXUFUJ6dbCsLD94r1MMXF5TZ
VoWJ/ceY+OG59pRlNeDmAx7NJRLDXdm6uTjlvLgS9QX8maWUm+FOTdUl69AyLN7uyy2NfVviJDNI
BuKnl8Nrbh7y97u6uAk2mL6NjRsKyqHTi5UOqk22Oq7Mq84IpYcGmgNQKKgJ8sTqKb+ZT5dyz58U
Y7HMoRbgPIJxJgxjryAbtxdZJ9xocI4dgIWqZa46KyvyWTFFHu2WXxy3YlGQP52RimlQSSY0Z52f
1oqxiS9RzExQe52bemYtEtGsv/JJg7u/zbiJzw==</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>0zcLhiAEnz5u0N6/3jLa3sEi32GjpwoXZJdFu0RqXE2Ta5Mi5lhDpp8jp4h5kIfvM6TW8bUlX/f5
pPhUhSvFLvxXpCZLxjPq0uVGbHsdftrrpRJ06RfXFd100o0ZXWVt7AjnZtd4Qg66u86yyQUQI8yK
EgepfsGkeXdcenmw4c6F9MKBVfHq75KT301K2HA9hOA9jCREeVam/mA4TjGtkm2XSskv3gjyybwH
5XYjXhWgptZSushle2sINpDEdAeKUCfEfSyhTGmWdnw0cz0ophan9TsS/rkVlswBSc7Hm5fz1TkI
5oeRQwafC6fTIySgiWGuWftiU8XNuHXQYU4XjQ==</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
			</saml2:Assertion>
			<ds:Signature Id="_2" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces PrefixList="wsse S"/>
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces PrefixList="wsu wsse S"/>
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>PizBtrMsLPfmul8bPhMykMmYuxw=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>cjk13oRfntxWITMrcIudP3uDxMtj+ud7vzBaa2qt6MsD2lzJ3VZlYhMa3T9u56lK5I8Lf2cCkZklW675j/GSUtYL0B97B+ieYqaADWt67xuDR4+fCcLb/cKTTT19tlwvCAlVqw+Z00CwrdfRrUQqaeLlp8M46F0JhJ0JPvDLDWDn2vZUNWZocpYIAGCciBjs1hRHdsvCFRBGzsBfL6Jd6gWFHCKt0v+qSykqAqX8JzRWOBN/a0A9s4GMq+JSQHiIQ2I9aNynkZ9NlmEjzvWYXbbESwwMFjigI6zaeK3w7IsOLu6cLSBIG8ENoc9GctySVm0HNs80gV79vn5cxrER5w==</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">5e82b88f-1b7e-466d-8258-72002c4af908</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<ns4:AdhocQueryRequest maxResults="-1" startIndex="0" federated="false" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns6="urn:gov:hhs:fha:nhinc:gateway:samltokendata">
			<ns4:ResponseOption returnComposedObjects="false" returnType="LeafClass"/>
			<ns2:AdhocQuery home="2.16.840.1.113883.0.200" id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<ns2:Slot name="$XDSDocumentEntryPatientId">
					<ns2:ValueList>
						<ns2:Value>'CAN20000042^^^&amp;2.16.840.1.113883.0.200&amp;ISO'</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryStatus">
					<ns2:ValueList>
						<ns2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved','urn:oasis:names:tc:ebxml-regrep:StatusType:DeferredCreation')</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryServiceStartTimeFrom">
					<ns2:ValueList>
						<ns2:Value>20080120000000</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryServiceStartTimeTo">
					<ns2:ValueList>
						<ns2:Value>20080220000000</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryServiceStopTimeFrom">
					<ns2:ValueList>
						<ns2:Value>20080220000000</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryServiceStopTimeTo">
					<ns2:ValueList>
						<ns2:Value>20080320000000</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
			</ns2:AdhocQuery>
		</ns4:AdhocQueryRequest>
	</S:Body>
</S:Envelope>
