ncpeh-simulation-mock/src/test/resources/de/gematik/ncpeh/api/mock/AdhocQueryRequestPSA.xml

<!--
  ~ Copyright 2024-2025 gematik GmbH
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  ~
  ~ *******
  ~
  ~ For additional notes and disclaimer from gematik and in case of changes by gematik find details in the "Readme" file.
  -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <!-- Note: The SOAP messages returned by the mock currently do not include the headers
     required for the individual transactions.-->
  <SOAP-ENV:Body>
    <ns3:AdhocQueryRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
      <ns3:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
      <AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <Slot name="$XDSDocumentEntryPatientId">
          <ValueList>
            <Value>'X110571344|ABC123^^^&amp;1.2.276.0.76.3.1.580.147&amp;ISO'</Value>
          </ValueList>
        </Slot>
        <Slot name="$XDSDocumentEntryStatus">
          <ValueList>
            <Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</Value>
          </ValueList>
        </Slot>
        <Slot name="$XDSDocumentEntryClassCode">
          <ValueList>
            <Value>('60591-5^^2.16.840.1.113883.6.1')</Value>
          </ValueList>
        </Slot>
      </AdhocQuery>
    </ns3:AdhocQueryRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>