lifeline-backend-master/apps/brusafe/templates/brusafe/list.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header xmlns:s="http://www.w3.org/2003/05/soap-envelope">
        <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:RegistryStoredQuery</a:Action>
        <a:MessageID>urn:uuid:2f80001f-7629-46db-9a56-6f5e6a694739</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To s:mustUnderstand="1">https://api.qa.brusafe.be:8094/services/registry-noxua/1.3.6.1.4.1.48336.1</a:To>
    </s:Header>
    <s:Body xmlns:s="http://www.w3.org/2003/05/soap-envelope">
        <query:AdhocQueryRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"
                                 xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
                                 xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
                                 xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0"
                                 xmlns:xdsb="urn:ihe:iti:xds-b:2007" xmlns:xop="http://www.w3.org/2004/08/xop/include">
            <query:ResponseOption returnComposedObjects="true" returnType="LeafClass"></query:ResponseOption>
            <rim:AdhocQuery home="urn:oid:1.3.6.1.4.1.48336.1" id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
                <rim:Slot name="$XDSDocumentEntryPatientId">
                    <rim:ValueList>
                        <rim:Value>'{{ national_registry }}'</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Slot name="$XDSDocumentEntryStatus">
                    <rim:ValueList>
                        <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
            </rim:AdhocQuery>
        </query:AdhocQueryRequest>
    </s:Body>
</s:Envelope>
